Revit 2024 API
NurbsSurfaceData.GetWeights Method
 Get the list of weights.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<double> GetWeights()
Visual Basic
Public Function GetWeights As IList(Of Double)
Visual C++
public:
IList<double>^ GetWeights()
See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace